{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.15.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_2",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 200],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "embedding_2_input"
            }
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_2",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [null, 200],
              "input_dim": 96,
              "output_dim": 64,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 200
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_6",
              "trainable": true,
              "dtype": "float32",
              "filters": 254,
              "kernel_size": [3],
              "strides": [1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_6",
              "trainable": true,
              "dtype": "float32",
              "strides": [2],
              "pool_size": [2],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_7",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3],
              "strides": [1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_7",
              "trainable": true,
              "dtype": "float32",
              "strides": [2],
              "pool_size": [2],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_8",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3],
              "strides": [1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_8",
              "trainable": true,
              "dtype": "float32",
              "strides": [2],
              "pool_size": [2],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_2",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 28,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": "float32",
              "units": 4,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "conv1d_6/kernel",
          "shape": [3, 64, 254],
          "dtype": "float32"
        },
        { "name": "conv1d_6/bias", "shape": [254], "dtype": "float32" },
        {
          "name": "conv1d_7/kernel",
          "shape": [3, 254, 128],
          "dtype": "float32"
        },
        { "name": "conv1d_7/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "conv1d_8/kernel",
          "shape": [3, 128, 64],
          "dtype": "float32"
        },
        { "name": "conv1d_8/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense_4/kernel", "shape": [64, 28], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [28], "dtype": "float32" },
        { "name": "dense_5/kernel", "shape": [28, 4], "dtype": "float32" },
        { "name": "dense_5/bias", "shape": [4], "dtype": "float32" },
        {
          "name": "embedding_2/embeddings",
          "shape": [96, 64],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/lstm_cell/kernel",
          "shape": [64, 256],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/lstm_cell/recurrent_kernel",
          "shape": [64, 256],
          "dtype": "float32"
        },
        { "name": "lstm_2/lstm_cell/bias", "shape": [256], "dtype": "float32" }
      ]
    }
  ]
}
